Reason I'm struggling here is I can't seem to install Tiller on the first go. I have to run `terraform apply twice`.

```
aws_eks_cluster.kube-cluster: Still creating... [7m10s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [7m20s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [7m30s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [7m40s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [7m50s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [8m0s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [8m10s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [8m20s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [8m30s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [8m40s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [8m50s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [9m0s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [9m10s elapsed]
aws_eks_cluster.kube-cluster: Still creating... [9m20s elapsed]
aws_eks_cluster.kube-cluster: Creation complete after 9m25s [id=terraform-eks-demo15]
data.aws_ami.eks-worker: Refreshing state...
aws_launch_configuration.kubedeploy: Creating...
aws_launch_configuration.kubedeploy: Creation complete after 4s [id=terraform-eks-demo1520190607135533997000000006]
aws_autoscaling_group.kubedeploy: Creating...
aws_autoscaling_group.kubedeploy: Still creating... [10s elapsed]
aws_autoscaling_group.kubedeploy: Still creating... [20s elapsed]
aws_autoscaling_group.kubedeploy: Still creating... [30s elapsed]
aws_autoscaling_group.kubedeploy: Still creating... [40s elapsed]
aws_autoscaling_group.kubedeploy: Creation complete after 47s [id=terraform-eks-demo15]
null_resource.configure-kubectl-local: Creating...
null_resource.configure-kubectl-local: Provisioning with 'local-exec'...
null_resource.configure-kubectl-local (local-exec): Executing: ["/bin/sh" "-c" "      aws eks update-kubeconfig --name terraform-eks-demo15 --region us-east-1 --kubeconfig ~/.kube/config;\n      kubectl config use-context arn:aws:eks:us-east-1:999323281678:cluster/terraform-eks-demo15;\n"]
null_resource.configure-kubectl-local (local-exec): Updated context arn:aws:eks:us-east-1:999323281678:cluster/terraform-eks-demo15 in /Users/ryan/.kube/config
null_resource.configure-kubectl-local (local-exec): Switched to context "arn:aws:eks:us-east-1:999323281678:cluster/terraform-eks-demo15".
null_resource.configure-kubectl-local: Creation complete after 5s [id=2955329731185507847]
null_resource.apply-auth-config-map: Creating...
null_resource.apply-auth-config-map: Provisioning with 'local-exec'...
null_resource.apply-auth-config-map (local-exec): Executing: ["/bin/sh" "-c" "cat <<EOF | kubectl apply -f -\n\n\napiVersion: v1\nkind: ConfigMap\nmetadata:\n  name: aws-auth\n  namespace: kube-system\ndata:\n  mapRoles: |\n    - rolearn: arn:aws:iam::999323281678:role/terraform-eks-demo15-node\n      username: system:node:{{EC2PrivateDNSName}}\n      groups:\n        - system:bootstrappers\n        - system:nodes\n\nEOF"]
null_resource.apply-auth-config-map (local-exec): configmap/aws-auth created
null_resource.apply-auth-config-map: Creation complete after 9s [id=8879267702225573169]
kubernetes_service_account.tiller: Creating...

Error: Post https://F5B5BA857F9BC6E03481CE526B29D3B2.sk1.us-east-1.eks.amazonaws.com/api/v1/namespaces/kube-system/serviceaccounts: dial tcp: lookup F5B5BA857F9BC6E03481CE526B29D3B2.sk1.us-east-1.eks.amazonaws.com on 192.168.156.1:53: no such host

  on kubernetes.tf line 7, in resource "kubernetes_service_account" "tiller":
   7: resource "kubernetes_service_account" "tiller" {


➜  terraform-base2 git:(master) ✗ terraform apply
data.aws_region.current: Refreshing state...
data.aws_availability_zones.available: Refreshing state...
aws_vpc.kubedeploy: Refreshing state... [id=vpc-00e283ddc4e9cec6d]
aws_iam_role.kube-node: Refreshing state... [id=terraform-eks-demo15-node]
aws_iam_role.kube-cluster: Refreshing state... [id=terraform-eks-demo15]
aws_iam_role_policy_attachment.kube-node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=terraform-eks-demo15-node-20190607134547401900000001]
aws_iam_instance_profile.kube-node: Refreshing state... [id=terraform-eks-demo15]
aws_iam_role_policy_attachment.kube-node-AmazonEKS_CNI_Policy: Refreshing state... [id=terraform-eks-demo15-node-20190607134547536300000005]
aws_iam_role_policy_attachment.kube-node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=terraform-eks-demo15-node-20190607134547528000000003]
aws_iam_role_policy_attachment.cluster-AmazonEKSClusterPolicy: Refreshing state... [id=terraform-eks-demo15-20190607134547528100000004]
aws_iam_role_policy_attachment.cluster-AmazonEKSServicePolicy: Refreshing state... [id=terraform-eks-demo15-20190607134547401900000002]
aws_security_group.kube-cluster: Refreshing state... [id=sg-03a4e22ab6c9b4923]
aws_subnet.kubedeploy[1]: Refreshing state... [id=subnet-09699e43fb6abb60e]
aws_subnet.kubedeploy[0]: Refreshing state... [id=subnet-013b2d3b2e63a3334]
aws_security_group.kube-node: Refreshing state... [id=sg-0335024ca07abe7c6]
aws_internet_gateway.kubedeploy: Refreshing state... [id=igw-07b00fd1d8813db0e]
aws_security_group_rule.kube-node-ingress-self: Refreshing state... [id=sgrule-1908758964]
aws_route_table.kubedeploy: Refreshing state... [id=rtb-0a60a575bc6951c30]
aws_security_group_rule.cluster-ingress-workstation-https: Refreshing state... [id=sgrule-741747196]
aws_security_group_rule.kube-node-ingress-cluster: Refreshing state... [id=sgrule-2036271370]
aws_security_group_rule.cluster-ingress-node-https: Refreshing state... [id=sgrule-118053593]
aws_eks_cluster.kube-cluster: Refreshing state... [id=terraform-eks-demo15]
aws_route_table_association.kubedeploy[0]: Refreshing state... [id=rtbassoc-0a629c6dd96ec4a8a]
aws_route_table_association.kubedeploy[1]: Refreshing state... [id=rtbassoc-011badb3b87b6564a]
data.aws_ami.eks-worker: Refreshing state...
aws_launch_configuration.kubedeploy: Refreshing state... [id=terraform-eks-demo1520190607135533997000000006]
aws_autoscaling_group.kubedeploy: Refreshing state... [id=terraform-eks-demo15]
null_resource.configure-kubectl-local: Refreshing state... [id=2955329731185507847]
null_resource.apply-auth-config-map: Refreshing state... [id=8879267702225573169]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_cluster_role_binding.tiller will be created
  + resource "kubernetes_cluster_role_binding" "tiller" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "tiller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "tiller"
          + namespace = "kube-system"
        }
    }

  # kubernetes_service_account.tiller will be created
  + resource "kubernetes_service_account" "tiller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "tiller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_service_account.tiller: Creating...
kubernetes_service_account.tiller: Creation complete after 2s [id=kube-system/tiller]
kubernetes_cluster_role_binding.tiller: Creating...
kubernetes_cluster_role_binding.tiller: Creation complete after 1s [id=tiller]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

I can't figure out dependencies or kubeconfig sourcing.